---
kind: method
id: M:Autodesk.Revit.UI.Macros.DocumentEntryPoint.Initialize(System.Object,System.String)
source: html/31cb998e-0a14-558b-da4d-d3a8610a3320.htm
---
# Autodesk.Revit.UI.Macros.DocumentEntryPoint.Initialize Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void Initialize(
	Object obj,
	string addinFolder
)
```

## Parameters
- **obj** (`System.Object`)
- **addinFolder** (`System.String`)